app/admin/categories.rb

  filter :status
  filter :featured
  filter :parent_id, as: :select, collection: -> {
    Category.where(parent_id: nil).map { |c| [c.name, c.id] }
---
SELECT "categories".* FROM "categories" WHERE "categories"."parent_id" IS NULL