app/admin/companies.rb

SELECT "categories"."name", "categories"."id" FROM "categories"
---
  filter :state
  filter :status, as: :select, collection: %w[active draft inactive]
  filter :starred
  filter :categories, as: :select,
                      collection: -> { Category.pluck(:name, :id) },
                      multiple: true

SELECT "categories"."name" FROM "categories" INNER JOIN "company_categories" ON "categories"."id" = "company_categories"."category_id" WHERE "company_categories"."company_id" = $1  [["company_id", 3]]
---
    def find_resource
      scoped_collection.friendly.find(params[:id])
    end
  end

  # Lista
  index do
    selectable_column
    id_column
    column :name
    column :seo_url
    column :status do |company|
      status_tag company.status, class: company.status == "active" ? "green" : "red"
    end
    column :starred do |company|
      status_tag(company.starred? ? "★ Destaque" : "Não", class: company.starred? ? "orange" : "gray")
    end
    column :categories do |company|
      company.categories.pluck(:name).join(', ')

SELECT "categories"."name" FROM "categories" INNER JOIN "company_categories" ON "categories"."id" = "company_categories"."category_id" WHERE "company_categories"."company_id" = $1  [["company_id", 1]]
---
      row :contact_email
      row :contact_phone
      row :categories do |company|
        company.categories.pluck(:name).join(', ')