app/admin/company_categories.rb

      f.input :seo_title
      f.input :short_description
      f.input :description
      f.input :parent, collection: Category.all.map { |c| [c.name, c.id] }
---
SELECT "categories".* FROM "categories"