app/models/category.rb

INSERT INTO "categories" ("name", "created_at", "updated_at", "seo_url", "seo_title", "short_description", "description", "parent_id", "kind", "status", "featured") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
SELECT "categories".* FROM "categories" WHERE "categories"."name" = $1 LIMIT $2  [["name", "Energia Solar"], ["LIMIT", 1]]
---
  def self.import_from_csv(file)
    imported = 0
    errors = []

    CSV.foreach(file.path, headers: true, encoding: 'bom|utf-8') do |row|
      begin
        category = find_or_initialize_by(name: row['name'].to_s.strip)
        category.assign_attributes(
          description:         row['description'],
          short_description:   row['short_description'],
          seo_title:           row['seo_title'],
          seo_url:             row['seo_url'],
          parent_id:           row['parent_id'].presence,
          kind:                row['kind'],
          status:              row['status']
        )

        if category.save
          imported += 1
        else
          errors << " '#{row['name']}' — #{category.errors.full_messages.join(', ')}"